In [132]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [133]:
data = pd.read_excel("titanic.xls")
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [134]:
data = data.drop(["name", "sibsp", "parch", "ticket", "fare", "cabin", "embarked", "boat", "body", "home.dest"], axis=1)
data = data.dropna(axis=0)
data.head()

   pclass  survived     sex      age
0       1         1  female  29.0000
1       1         1    male   0.9167
2       1         0  female   2.0000
3       1         0    male  30.0000
4       1         0  female  25.0000

In [135]:
# data.loc[data["age"] <= 20.0, ["age"]] = 0
# data.loc[(data["age"] > 20) & (data["age"] <= 30.0), ["age"]] = 1
# data.loc[(data["age"] > 30) & (data["age"] <= 40.0), ["age"]] = 2
# data.loc[data["age"] > 40.0, ["age"]] = 3

In [136]:
def category_ages(age):
    if age <= 20.0:
        return "<20 ans"
    elif age <= 30.0:
        return "20-30 ans"
    elif age <= 40.0:
        return "30-40 ans"
    else:
        return ">40 ans"

In [137]:
data["age"] = data["age"].map(category_ages)

In [138]:
data["age"]

0       20-30 ans
1         <20 ans
2         <20 ans
3       20-30 ans
4       20-30 ans
          ...
1301      >40 ans
1304      <20 ans
1306    20-30 ans
1307    20-30 ans
1308    20-30 ans
Name: age, Length: 1046, dtype: object

In [139]:
data["age"].value_counts()

20-30 ans    361
<20 ans      248
>40 ans      227
30-40 ans    210
Name: age, dtype: int64

In [149]:
# data["sex"].map({"male":0, "female":1})
# data["sex"].replace(["male", "female", [0, 1]])
data["sex"].astype("category").cat.codes

0       0
1       1
2       0
3       1
4       0
       ..
1301    1
1304    0
1306    1
1307    1
1308    1
Length: 1046, dtype: int8

In [148]:
# Convert 'sex' column to categorical and get the codes
codes = data['sex'].astype('category').cat.codes

# Get the categories and their corresponding codes
categories = data['sex'].astype('category').cat.categories

# Create a dictionary mapping codes to categories
code_to_category = {code: category for code, category in zip(codes, categories)}

# Print the code-to-category mapping
for code, category in code_to_category.items():
    print(f"Code: {code}, Category: {category}")

Code: 0, Category: female
Code: 1, Category: male